In [6]:
# dependencies
import pandas as pd
import csv
import numpy as np

In [7]:
# Import csv's in Dataframes
departments_df = pd.read_csv("departments.csv")
dept_emp_df = pd.read_csv("dept_emp.csv")
dept_manager_df = pd.read_csv("dept_manager.csv")
employees_df = pd.read_csv("employees.csv")
salaries_df = pd.read_csv("salaries.csv")
titles_df = pd.read_csv("titles.csv")

In [8]:
display(departments_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dept_no    9 non-null      object
 1   dept_name  9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

None

In [17]:
display(departments_df.value_counts())

dept_no  dept_name
d001     Marketing             1
d002     Finance               1
d003     Human Resources       1
d004     Production            1
d005     Development           1
d006     Quality Management    1
d007     Sales                 1
d008     Research              1
d009     Customer Service      1
Name: count, dtype: int64

In [9]:
display(dept_emp_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331603 entries, 0 to 331602
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   emp_no   331603 non-null  int64
 1   dept_no  331603 non-null  object
dtypes: int64(1), object(1)
memory usage: 5.1+ MB

None

In [23]:
display(dept_emp_df.head(3))

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004

In [25]:
display(dept_emp_df.nunique())

emp_no     300024
dept_no         9
dtype: int64

In [10]:
display(dept_manager_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dept_no  24 non-null     object
 1   emp_no   24 non-null     int64
dtypes: int64(1), object(1)
memory usage: 516.0+ bytes

None

In [22]:
display(dept_manager_df.head(3))

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085

In [18]:
display(dept_manager_df['dept_no'].value_counts())

dept_no
d004    4
d006    4
d009    4
d001    2
d002    2
d003    2
d005    2
d007    2
d008    2
Name: count, dtype: int64

In [27]:
display(dept_manager_df.nunique())

dept_no     9
emp_no     24
dtype: int64

In [11]:
display(employees_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   emp_no        300024 non-null  int64
 1   emp_title_id  300024 non-null  object
 2   birth_date    300024 non-null  object
 3   first_name    300024 non-null  object
 4   last_name     300024 non-null  object
 5   sex           300024 non-null  object
 6   hire_date     300024 non-null  object
dtypes: int64(1), object(6)
memory usage: 16.0+ MB

None

In [21]:
display(employees_df.head(3))

   emp_no emp_title_id  birth_date first_name  last_name sex  hire_date
0  473302        s0001   7/25/1953   Hideyuki   Zallocco   M  4/28/1990
1  475053        e0002  11/18/1954      Byong  Delgrande   F   9/7/1991
2   57444        e0002   1/30/1958      Berry       Babb   F  3/21/1992

In [19]:
display(employees_df['emp_title_id'].value_counts())

emp_title_id
s0001    107384
e0003     97747
e0002     47303
s0002     26583
e0004     15148
e0001      5835
m0001        24
Name: count, dtype: int64

In [12]:
display(salaries_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   emp_no  300024 non-null  int64
 1   salary  300024 non-null  int64
dtypes: int64(2)
memory usage: 4.6 MB

None

In [20]:
display(salaries_df.head(3))

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006

In [13]:
display(titles_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title_id  7 non-null      object
 1   title     7 non-null      object
dtypes: object(2)
memory usage: 244.0+ bytes

None

In [15]:
display(titles_df.value_counts())

title_id  title
e0001     Assistant Engineer    1
e0002     Engineer              1
e0003     Senior Engineer       1
e0004     Technique Leader      1
m0001     Manager               1
s0001     Staff                 1
s0002     Senior Staff          1
Name: count, dtype: int64